
"Quarterly" = "Scuola del Sabato in un unico luogo";

"Lesson" = "Lezioni settimanali";

"Reading" = "Leggi e studia Scuola del Sabato";

"Verse" = "Versetti della Bibbia a portata di mano";

"Theme" = "Esperienza di lettura personalizzabile";
